In [4]:
people = {'first' : ['rifat', 'anik', 'samsu'], 'last' : ['khan', 'hal', 'pop'], 'age': [20, 22, 32]}

In [5]:
import pandas as pd

In [6]:
df = pd.DataFrame(people)

In [7]:
df

   first  last  age
0  rifat  khan   20
1   anik   hal   22
2  samsu   pop   32

In [8]:
df['full_name']= df['first']+' '+ df['last']

In [9]:
df

   first  last  age   full_name
0  rifat  khan   20  rifat khan
1   anik   hal   22    anik hal
2  samsu   pop   32   samsu pop

In [17]:
df.append({'first': 'kubi','last':'khan'},ignore_index=True)

   first  last   age   full_name
0  rifat  khan  20.0  rifat khan
1   anik   hal  22.0    anik hal
2  samsu   pop  32.0   samsu pop
3   kubi  khan   NaN         NaN

In [19]:
df.drop(index = 0, inplace = True)

In [20]:
df

   first last  age  full_name
1   anik  hal   22   anik hal
2  samsu  pop   32  samsu pop

In [25]:
df.drop(columns = ['first','last'], inplace = True)

In [26]:
df

   age  full_name
1   22   anik hal
2   32  samsu pop

In [28]:
df['full_name'].str.split(expand = True)

       0    1
1   anik  hal
2  samsu  pop

In [31]:
df[['first','last']] = df['full_name'].str.split(expand = True)

In [32]:
df

   age  full_name  first last
1   22   anik hal   anik  hal
2   32  samsu pop  samsu  pop

In [33]:
people = {'first' : ['rif', 'an', 'sam'], 'last' : ['kha', 'halx', 'popil'], 'age': [20, 22, 32]}
df2 = pd.DataFrame(people)

In [35]:
df1 = df.append(df2)

In [36]:
df1

   age  full_name  first   last
1   22   anik hal   anik    hal
2   32  samsu pop  samsu    pop
0   20        NaN    rif    kha
1   22        NaN     an   halx
2   32        NaN    sam  popil

In [41]:
filt = df1['last'] =='hal'

In [42]:
df1.drop(index = df1[filt].index)

   age  full_name  first   last
2   32  samsu pop  samsu    pop
0   20        NaN    rif    kha
2   32        NaN    sam  popil